In [1]:
# pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\gostj\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\gostj\appdata\roaming\python\python39\site-packages (from mysql-connector-python) (3.20.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

In [9]:
# Create Connection
# Start by creating a connection to the database.

# Use the username and password from your MySQL database:


import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="test"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000014037FF1DF0>

In [10]:
## show database
mycursor = mydb.cursor()

mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('a2bm',)
('h_trifecta',)
('information_schema',)
('l_netflix',)
('mysql',)
('performance_schema',)
('sys',)
('test',)

# Create a table named "customers":

In [40]:
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [41]:
#show table in database
mycursor.execute("SHOW TABLES")

for x in mycursor:
  print(x)

('customers',)
('players',)
('test1',)
('test2',)

In [42]:
# add column

mycursor.execute("ALTER TABLE customers ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

### Insert Into Table

In [43]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

mydb.commit()

print(mycursor.rowcount, "record inserted.")

1 record inserted.

### Insert Multiple Rows

In [44]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = [
  ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.") #mycursor.rowcount

13 was inserted.

In [45]:
##### Get Inserted ID

sql = "INSERT INTO customers (name, address) VALUES (%s, %s)" # "command"
val = ("Michelle", "Blue Village")
mycursor.execute(sql, val)

mydb.commit()

print("1 record inserted, ID:", mycursor.lastrowid) #mycursor.lastrowid

1 record inserted, ID: 15

## Select From a Table

In [19]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()  ### fetchone() only first one row

for x in myresult:
  print(x)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Michelle', 'Blue Village', 15)

In [25]:
print(myresult)

[('John', 'Highway 21', 1), ('Peter', 'Lowstreet 4', 2), ('Amy', 'Apple st 652', 3), ('Hannah', 'Mountain 21', 4), ('Michael', 'Valley 345', 5), ('Sandy', 'Ocean blvd 2', 6), ('Betty', 'Green Grass 1', 7), ('Richard', 'Sky st 331', 8), ('Susan', 'One way 98', 9), ('Vicky', 'Yellow Garden 2', 10), ('Ben', 'Park Lane 38', 11), ('William', 'Central st 954', 12), ('Chuck', 'Main Road 989', 13), ('Viola', 'Sideway 1633', 14), ('Michelle', 'Blue Village', 15)]

In [28]:
import pandas as pd
data1 = pd.DataFrame(myresult)

data1.head(5)

         0             1  2
0     John    Highway 21  1
1    Peter   Lowstreet 4  2
2      Amy  Apple st 652  3
3   Hannah   Mountain 21  4
4  Michael    Valley 345  5

In [30]:
# fix columns name
data1.columns = ['name','address', 'id']
data1.head(15)

        name          address  id
0       John       Highway 21   1
1      Peter      Lowstreet 4   2
2        Amy     Apple st 652   3
3     Hannah      Mountain 21   4
4    Michael       Valley 345   5
5      Sandy     Ocean blvd 2   6
6      Betty    Green Grass 1   7
7    Richard       Sky st 331   8
8      Susan       One way 98   9
9      Vicky  Yellow Garden 2  10
10       Ben     Park Lane 38  11
11   William   Central st 954  12
12     Chuck    Main Road 989  13
13     Viola     Sideway 1633  14
14  Michelle     Blue Village  15

## Delete Record

In [34]:
sql = "DELETE FROM customers WHERE address = 'Mountain 21'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) deleted")

0 record(s) deleted

In [38]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()  ### fetchone() only first one row

for x in myresult:
    print(x)

data1 = pd.DataFrame(myresult)

data1.head(15)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Michael', 'Valley 345', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Michelle', 'Blue Village', 15)

           0                1   2
0       John       Highway 21   1
1      Peter      Lowstreet 4   2
2        Amy     Apple st 652   3
3    Michael       Valley 345   5
4      Sandy     Ocean blvd 2   6
5      Betty    Green Grass 1   7
6    Richard       Sky st 331   8
7      Susan       One way 98   9
8      Vicky  Yellow Garden 2  10
9        Ben     Park Lane 38  11
10   William   Central st 954  12
11     Chuck    Main Road 989  13
12     Viola     Sideway 1633  14
13  Michelle     Blue Village  15

3	Hannah	Mountain 21	4 was delete

## Drop Table

In [39]:
sql = "DROP TABLE customers"

mycursor.execute(sql)

In [46]:
sql = "UPDATE customers SET address = 'Canyon 123' WHERE address = 'Valley 345'"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount, "record(s) affected")

1 record(s) affected

In [47]:
mycursor.execute("SELECT * FROM customers")

myresult = mycursor.fetchall()  ### fetchone() only first one row

for x in myresult:
    print(x)

data1 = pd.DataFrame(myresult)

data1.head(15)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Canyon 123', 5)
('Sandy', 'Ocean blvd 2', 6)
('Betty', 'Green Grass 1', 7)
('Richard', 'Sky st 331', 8)
('Susan', 'One way 98', 9)
('Vicky', 'Yellow Garden 2', 10)
('Ben', 'Park Lane 38', 11)
('William', 'Central st 954', 12)
('Chuck', 'Main Road 989', 13)
('Viola', 'Sideway 1633', 14)
('Michelle', 'Blue Village', 15)

           0                1   2
0       John       Highway 21   1
1      Peter      Lowstreet 4   2
2        Amy     Apple st 652   3
3     Hannah      Mountain 21   4
4    Michael       Canyon 123   5
5      Sandy     Ocean blvd 2   6
6      Betty    Green Grass 1   7
7    Richard       Sky st 331   8
8      Susan       One way 98   9
9      Vicky  Yellow Garden 2  10
10       Ben     Park Lane 38  11
11   William   Central st 954  12
12     Chuck    Main Road 989  13
13     Viola     Sideway 1633  14
14  Michelle     Blue Village  15

[Michael, Valley 345, 5]  become [Michael, Canyon 123, 5]

## Limit

In [48]:
mycursor.execute("SELECT * FROM customers LIMIT 5")

myresult = mycursor.fetchall()

for x in myresult:
    print(x)

data1 = pd.DataFrame(myresult)

data1.head(15)

('John', 'Highway 21', 1)
('Peter', 'Lowstreet 4', 2)
('Amy', 'Apple st 652', 3)
('Hannah', 'Mountain 21', 4)
('Michael', 'Canyon 123', 5)

         0             1  2
0     John    Highway 21  1
1    Peter   Lowstreet 4  2
2      Amy  Apple st 652  3
3   Hannah   Mountain 21  4
4  Michael    Canyon 123  5

In [49]:
## Start from position 3, and return 5 records:

mycursor.execute("SELECT * FROM customers LIMIT 5 OFFSET 2")

myresult = mycursor.fetchall()

data1 = pd.DataFrame(myresult)

data1.head(15)

         0              1  2
0      Amy   Apple st 652  3
1   Hannah    Mountain 21  4
2  Michael     Canyon 123  5
3    Sandy   Ocean blvd 2  6
4    Betty  Green Grass 1  7

## Join

In [50]:
# create table users
mycursor.execute("CREATE TABLE users (id VARCHAR(255), name VARCHAR(255), fav VARCHAR(255))")

In [51]:
sql = "INSERT INTO users (id, name, fav) VALUES (%s, %s, %s)"
val = [
  ('1', 'John', '154'),
  ('2', 'Peter', '154'),
  ('3', 'Amy', '155'),
  ('4', 'Hannah', ' '),
  ('5', 'Michael', ' '),
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.") #mycursor.rowcount

5 was inserted.

In [52]:
mycursor.execute("SELECT * FROM users")

myresult = mycursor.fetchall()

data1 = pd.DataFrame(myresult)

data1.head(15)

   0        1    2
0  1     John  154
1  2    Peter  154
2  3      Amy  155
3  4   Hannah
4  5  Michael

In [53]:
mycursor.execute("CREATE TABLE products (id VARCHAR(255), name VARCHAR(255))")

In [58]:
sql = "INSERT INTO products (id, name) VALUES (%s, %s)"
val = [
  ('154', 'Chocolate Heaven'),
  ('155', 'Tasty Lemons'),
  ('156', 'Vanilla Dreams')
]

mycursor.executemany(sql, val)

mydb.commit()

print(mycursor.rowcount, "was inserted.") #mycursor.rowcount

3 was inserted.

In [57]:
# sql = "DELETE FROM users WHERE name = 'Vanilla Dreams'"

# mycursor.execute(sql)

# mydb.commit()

# print(mycursor.rowcount, "record(s) deleted")

1 record(s) deleted

In [59]:
mycursor.execute("SELECT * FROM products")

myresult = mycursor.fetchall()

data1 = pd.DataFrame(myresult)

data1.head(15)

     0                 1
0  154  Chocolate Heaven
1  155      Tasty Lemons
2  156    Vanilla Dreams

In [60]:
sql = "SELECT \
  users.name AS user, \
  products.name AS favorite \
  FROM users \
  INNER JOIN products ON users.fav = products.id"

mycursor.execute(sql)

myresult = mycursor.fetchall()

data1 = pd.DataFrame(myresult)

data1.head(15)

       0                 1
0   John  Chocolate Heaven
1  Peter  Chocolate Heaven
2    Amy      Tasty Lemons